; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v5 ?v1)
             (pred_11 ?v4 ?v7)
             (pred_8 ?v5 ?v7)
             (pred_1 ?v8 ?v5 )
	     (pred_12 ?v5)
             (pred_10 ?v2)
             (pred_4 ?v4)
             (pred_7 ?v7)
             (pred_9 ?v5)
             (pred_2 ?v4)
             (pred_6 ?v5)
             (pred_5 ))



(:action op_1
:parameters (?v9 ?v13 ?v3 ?v11)
:precondition (and (pred_10 ?v9) (pred_10 ?v13) (pred_4 ?v3) (pred_7 ?v11)
          (pred_3 ?v9 ?v13) (pred_11 ?v3 ?v11)
                   (pred_8 ?v13 ?v11) (pred_12 ?v9) 
                   (pred_9 ?v13) (pred_2 ?v3))
:effect (and  (pred_6 ?v13) (not (pred_9 ?v13))))


(:action op_5
:parameters (?v9 ?v10)
:precondition (and (pred_10 ?v9) (pred_10 ?v10)
               (pred_12 ?v9) (pred_3 ?v9 ?v10) (pred_6 ?v10))
:effect (and (pred_12 ?v10) (not (pred_12 ?v9))))

(:action op_2
:parameters (?v9 ?v3)
:precondition (and (pred_10 ?v9) (pred_4 ?v3) 
                  (pred_12 ?v9) (pred_1 ?v3 ?v9) (pred_5 ))
:effect (and (pred_2 ?v3)
   (not (pred_1 ?v3 ?v9)) (not (pred_5 ))))


(:action op_4
:parameters (?v9 ?v12 ?v6)
:precondition (and (pred_10 ?v9) (pred_4 ?v12) (pred_4 ?v6)
                  (pred_12 ?v9) (pred_2 ?v6) (pred_1 ?v12 ?v9))
:effect (and (pred_2 ?v12) (pred_1 ?v6 ?v9)
        (not (pred_2 ?v6)) (not (pred_1 ?v12 ?v9))))

(:action op_3
:parameters (?v9 ?v3)
:precondition (and (pred_10 ?v9) (pred_4 ?v3) 
                  (pred_12 ?v9) (pred_2 ?v3))
:effect (and (pred_5 ) (pred_1 ?v3 ?v9) (not (pred_2 ?v3)))))

; problem
(define (problem grid-5-5-2-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_19 obj_23 obj_29 obj_20 obj_28 obj_14 obj_26 obj_07 obj_15 obj_12 obj_02 obj_06 obj_22 obj_09 obj_30 obj_01 obj_27 obj_21 obj_18 obj_10 obj_17 obj_13 obj_25 obj_11
    obj_08 obj_05
    obj_03 obj_16 obj_24
    )

    (:init
       (pred_5)

       (pred_10 obj_04)
       (pred_10 obj_19)
       (pred_10 obj_23)
       (pred_10 obj_29)
       (pred_10 obj_20)
       (pred_10 obj_28)
       (pred_10 obj_14)
       (pred_10 obj_26)
       (pred_10 obj_07)
       (pred_10 obj_15)
       (pred_10 obj_12)
       (pred_10 obj_02)
       (pred_10 obj_06)
       (pred_10 obj_22)
       (pred_10 obj_09)
       (pred_10 obj_30)
       (pred_10 obj_01)
       (pred_10 obj_27)
       (pred_10 obj_21)
       (pred_10 obj_18)
       (pred_10 obj_10)
       (pred_10 obj_17)
       (pred_10 obj_13)
       (pred_10 obj_25)
       (pred_10 obj_11)
       (pred_7 obj_08)
       (pred_7 obj_05)
       (pred_4 obj_03)
       (pred_4 obj_16)
       (pred_4 obj_24)

       (pred_3 obj_04 obj_28)
       (pred_3 obj_04 obj_19)
       (pred_3 obj_19 obj_14)
       (pred_3 obj_19 obj_23)
       (pred_3 obj_19 obj_04)
       (pred_3 obj_23 obj_26)
       (pred_3 obj_23 obj_29)
       (pred_3 obj_23 obj_19)
       (pred_3 obj_29 obj_07)
       (pred_3 obj_29 obj_20)
       (pred_3 obj_29 obj_23)
       (pred_3 obj_20 obj_15)
       (pred_3 obj_20 obj_29)
       (pred_3 obj_28 obj_12)
       (pred_3 obj_28 obj_14)
       (pred_3 obj_28 obj_04)
       (pred_3 obj_14 obj_02)
       (pred_3 obj_14 obj_26)
       (pred_3 obj_14 obj_19)
       (pred_3 obj_14 obj_28)
       (pred_3 obj_26 obj_06)
       (pred_3 obj_26 obj_07)
       (pred_3 obj_26 obj_23)
       (pred_3 obj_26 obj_14)
       (pred_3 obj_07 obj_22)
       (pred_3 obj_07 obj_15)
       (pred_3 obj_07 obj_29)
       (pred_3 obj_07 obj_26)
       (pred_3 obj_15 obj_09)
       (pred_3 obj_15 obj_20)
       (pred_3 obj_15 obj_07)
       (pred_3 obj_12 obj_30)
       (pred_3 obj_12 obj_02)
       (pred_3 obj_12 obj_28)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_02 obj_06)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_02 obj_12)
       (pred_3 obj_06 obj_27)
       (pred_3 obj_06 obj_22)
       (pred_3 obj_06 obj_26)
       (pred_3 obj_06 obj_02)
       (pred_3 obj_22 obj_21)
       (pred_3 obj_22 obj_09)
       (pred_3 obj_22 obj_07)
       (pred_3 obj_22 obj_06)
       (pred_3 obj_09 obj_18)
       (pred_3 obj_09 obj_15)
       (pred_3 obj_09 obj_22)
       (pred_3 obj_30 obj_10)
       (pred_3 obj_30 obj_01)
       (pred_3 obj_30 obj_12)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_01 obj_27)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_30)
       (pred_3 obj_27 obj_13)
       (pred_3 obj_27 obj_21)
       (pred_3 obj_27 obj_06)
       (pred_3 obj_27 obj_01)
       (pred_3 obj_21 obj_25)
       (pred_3 obj_21 obj_18)
       (pred_3 obj_21 obj_22)
       (pred_3 obj_21 obj_27)
       (pred_3 obj_18 obj_11)
       (pred_3 obj_18 obj_09)
       (pred_3 obj_18 obj_21)
       (pred_3 obj_10 obj_17)
       (pred_3 obj_10 obj_30)
       (pred_3 obj_17 obj_13)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_10)
       (pred_3 obj_13 obj_25)
       (pred_3 obj_13 obj_27)
       (pred_3 obj_13 obj_17)
       (pred_3 obj_25 obj_11)
       (pred_3 obj_25 obj_21)
       (pred_3 obj_25 obj_13)
       (pred_3 obj_11 obj_18)
       (pred_3 obj_11 obj_25)
       (pred_9 obj_23)
       (pred_9 obj_12)
       (pred_9 obj_09)
       (pred_8  obj_23 obj_08)
       (pred_8  obj_12 obj_05)
       (pred_8  obj_09 obj_05)
       (pred_6 obj_04)
       (pred_6 obj_19)
       (pred_6 obj_29)
       (pred_6 obj_20)
       (pred_6 obj_28)
       (pred_6 obj_14)
       (pred_6 obj_26)
       (pred_6 obj_07)
       (pred_6 obj_15)
       (pred_6 obj_02)
       (pred_6 obj_06)
       (pred_6 obj_22)
       (pred_6 obj_30)
       (pred_6 obj_01)
       (pred_6 obj_27)
       (pred_6 obj_21)
       (pred_6 obj_18)
       (pred_6 obj_10)
       (pred_6 obj_17)
       (pred_6 obj_13)
       (pred_6 obj_25)
       (pred_6 obj_11)

       (pred_11  obj_03 obj_08)
       (pred_11  obj_16 obj_05)
       (pred_11  obj_24 obj_08)
       (pred_1 obj_03 obj_25)
       (pred_1 obj_16 obj_10)
       (pred_1 obj_24 obj_22)
       (pred_12 obj_01)
    )

    (:goal (and
       (pred_1 obj_03 obj_18)
       (pred_1 obj_24 obj_19)
    ))
(:constraints
  (always (not (pred_12 obj_21)))
)
)

; plan
1. (op_5 obj_01 obj_02)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_02)
   goals met: 0 of 2
2. (op_5 obj_02 obj_06)
   deleted: (pred_12 obj_02)
   added: (pred_12 obj_06)
   goals met: 0 of 2
3. (op_5 obj_06 obj_22)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_22)
   goals met: 0 of 2
4. (op_2 obj_22 obj_24)
   deleted: (pred_1 obj_24 obj_22) (pred_5)
   added: (pred_2 obj_24)
   goals met: 0 of 2
5. (op_5 obj_22 obj_06)
   deleted: (pred_12 obj_22)
   added: (pred_12 obj_06)
   goals met: 0 of 2
6. (op_5 obj_06 obj_27)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_27)
   goals met: 0 of 2
7. (op_5 obj_27 obj_13)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_13)
   goals met: 0 of 2
8. (op_5 obj_13 obj_25)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_25)
   goals met: 0 of 2
9. (op_4 obj_25 obj_03 obj_24)
   deleted: (pred_2 obj_24) (pred_1 obj_03 obj_25)
   added: (pred_2 obj_03) (pred_1 obj_24 obj_25)
   goals met: 0 of 2
10. (op_5 obj_25 obj_11)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_11)
   goals met: 0 of 2
11. (op_5 obj_11 obj_18)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_18)
   goals met: 0 of 2
12. (op_3 obj_18 obj_03)
   deleted: (pred_2 obj_03)
   added: (pred_5) (pred_1 obj_03 obj_18)
   goals met: 1 of 2
13. (op_5 obj_18 obj_11)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_11)
   goals met: 1 of 2
14. (op_5 obj_11 obj_25)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_25)
   goals met: 1 of 2
15. (op_2 obj_25 obj_24)
   deleted: (pred_1 obj_24 obj_25) (pred_5)
   added: (pred_2 obj_24)
   goals met: 1 of 2
16. (op_5 obj_25 obj_13)
   deleted: (pred_12 obj_25)
   added: (pred_12 obj_13)
   goals met: 1 of 2
17. (op_5 obj_13 obj_27)
   deleted: (pred_12 obj_13)
   added: (pred_12 obj_27)
   goals met: 1 of 2
18. (op_5 obj_27 obj_06)
   deleted: (pred_12 obj_27)
   added: (pred_12 obj_06)
   goals met: 1 of 2
19. (op_5 obj_06 obj_26)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_26)
   goals met: 1 of 2
20. (op_5 obj_26 obj_14)
   deleted: (pred_12 obj_26)
   added: (pred_12 obj_14)
   goals met: 1 of 2
21. (op_5 obj_14 obj_19)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_19)
   goals met: 1 of 2
22. (op_3 obj_19 obj_24)
   deleted: (pred_2 obj_24)
   added: (pred_5) (pred_1 obj_24 obj_19)
   goals met: 2 of 2
